performance/tests/pre-register.yaml
config:
  target: "http://localhost:3333/api"
  payload:
    path: "../data/usuarios.csv"
    fields:
      - "name"
      - "email"
      - "password"
  phases:
    - name: "Carga de Usuários"
      duration: 6000
      arrivalRate: 1
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Cadastro de Usuários do CSV"
    flow:
      - post:
          url: "/auth/register"
          json:
            name: "{{ name }}"
            email: "{{ email }}"
            password: "{{ password }}"
          expect:
            - statusCode: 201
            - hasProperty: "user"
            - match:
                json: "$.message"
                value: "Usuário cadastrado com sucesso!"